import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

const store = new Vuex.Store({
	state: {
		user: localStorage.userInfo ? JSON.parse(localStorage.userInfo) : null,
		audio: [{
			name: "夏天的风",
			artist: "温岚",
			url: "http://m7.music.126.net/20220503020742/d3848719d517e0c3b357db36188548ac/ymusic/55dd/ec77/ac42/e3fc30b5762ebe1118bd8518d95288ec.flac",
			cover: "https://p2.music.126.net/1EDhWA3a0oIagLtiK41qrw==/109951163239130461.jpg",
			lrc: "[00:00.000] 作词 : 天天\n" +
				"[00:00.765] 作曲 : 周杰伦\n" +
				"[00:01.530] 编曲 : 林迈可\n" +
				"[00:02.295] 制作人 : 林迈可\n" +
				"[00:03.60]Yeah En\n" +
				"[00:16.68]七月的风懒懒的\n" +
				"[00:20.80]连云都变热热的\n" +
				"[00:25.04]不久后天闷闷的\n" +
				"[00:27.97]一阵云后雨下过\n" +
				"[00:32.44]Woo yeah\n" +
				"[00:35.22]气温 爬升到无法再忍受\n" +
				"[00:41.79]索性闭上了双眼\n" +
				"[00:44.74]让想象任意改变\n" +
				"[00:49.77]场景 两个人一起散着步\n" +
				"[00:54.56]我的脸也轻轻贴着你胸口\n" +
				"[00:58.93]听到心跳 Wo\n" +
				"[01:01.43]在乎我 和天气一样温度\n" +
				"[01:07.27]夏天的风 我永远记得\n" +
				"[01:11.53]清清楚楚地说你爱我\n" +
				"[01:15.80]我看见你酷酷的笑容\n" +
				"[01:19.79]也有腼腆的时候\n" +
				"[01:23.98]夏天的风 正暖暖吹过\n" +
				"[01:28.35]穿过头发穿过耳朵\n" +
				"[01:32.52]你和我的夏天\n" +
				"[01:35.27]风轻轻说着\n" +
				"[01:42.49]温柔懒懒的海风\n" +
				"[01:44.52]吹到高高的山峰\n" +
				"[01:46.60]温的风 山的风\n" +
				"[01:48.66]吹成了山峰\n" +
				"[01:50.85]温柔懒懒的海风\n" +
				"[01:52.87]吹到高高的山峰\n" +
				"[01:55.02]温的风 山的峰\n" +
				"[01:57.00]吹成了山风\n" +
				"[01:59.33]温柔懒懒的海风\n" +
				"[02:01.31]吹到高高的山峰\n" +
				"[02:03.44]温的风 山的峰\n" +
				"[02:05.57]吹成了山风\n" +
				"[02:07.75]为什么你不在\n" +
				"[02:09.78]问山风你会回来\n" +
				"[02:14.12]场景 两个人一起散着步\n" +
				"[02:18.75]我的脸也轻轻贴着你胸口\n" +
				"[02:23.26]听到心跳 Wo\n" +
				"[02:25.60]在乎我 和天气一样温度\n" +
				"[02:31.54]夏天的风 我永远记得\n" +
				"[02:35.66]清清楚楚地说你爱我\n" +
				"[02:39.94]我看见你酷酷的笑容\n" +
				"[02:43.97]也有腼腆的时候\n" +
				"[02:48.33]夏天的风 正暖暖吹过\n" +
				"[02:52.50]穿过头发穿过耳朵\n" +
				"[02:56.75]你和我的夏天\n" +
				"[02:59.45]风轻轻说着\n" +
				"[03:05.19]夏天的风 我永远记得\n" +
				"[03:09.51]清清楚楚地说你爱我\n" +
				"[03:13.74]我看见你酷酷的笑容\n" +
				"[03:17.56]也有腼腆的时候\n" +
				"[03:22.03]夏天的风 正暖暖吹过\n" +
				"[03:26.40]穿过头发穿过耳朵\n" +
				"[03:30.44]你和我的夏天\n" +
				"[03:33.16]风轻轻说着\n" +
				"[03:56.932]合声编写 : 林迈可\n" +
				"[03:57.074]合声 : 温岚\n" +
				"[03:57.205]录音工程 : 林迈可 (ALFA STUDIO)\n" +
				"[03:57.340]混音工程 : 杨大纬 (杨大纬录音工作室)\n" +
				"[03:57.448]OP : 神奇绿光科技有限公司\n" +
				"[03:57.641]SP : BMG Music Publishing Taiwan\n" +
				"[03:57.790]OP : Alfa Music Publishing Co.,Ltd.\n" +
				"[03:57.923]TWC230407407\n",
		},],
	},
	mutations: {
		setUserLogin(state, payload) {
			state.user = payload;
			localStorage.userInfo = JSON.stringify(state.user);
		},
		addSong(state,payload) {
			state.audio.push(payload);
		}
	},
	actions: {},
	modules: {}
})

export default store;
